IDEA StatiCa Open Model
CrossSectionGeneralColdFormed.CrossSectionType Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Type of cross-section
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public CrossSectionType CrossSectionType { get; set; }
Public Property CrossSectionType As CrossSectionType
	Get
	Set
public:
property CrossSectionType CrossSectionType {
	CrossSectionType get ();
	void set (CrossSectionType value);
}
Property Value
Type: CrossSectionType
See Also
Reference
CrossSectionGeneralColdFormed Class
IdeaRS.OpenModel.CrossSection Namespace